<?php

return [
    'custom' => [
        'department_uuid' => [
            'required' => 'حقل معرف القسم مطلوب.',
            'exists' => 'معرف القسم المحدد غير صالح.',
            "unique" => "هذا القسم موجود بالفعل.",
            "uuid" => "المعرف الفريد غير صالح.",
        ],
        'name' => [
            'required' => 'حقل الاسم مطلوب.',
            "array" => 'يجب ارسال الاسم بشكل مصفوفة ',
            'max' => 'الاسم طويل'
        ],
        'name.en' => [
            'required' => 'حقل الاسم الإنجليزي مطلوب.',
            'string' => 'يجب أن يكون الاسم الإنجليزي نصًا.',
            'min' => 'يجب ألا يقل الاسم الإنجليزي عن :min حروف.',
            'max' => 'يجب ألا يتجاوز الاسم الإنجليزي :max حروف.',
            'unique' => 'هذا الاسم الإنجليزي موجود بالفعل في هذا القسم.',
        ],
        'name.ar' => [
            'required' => 'حقل الاسم العربي مطلوب.',
            'string' => 'يجب أن يكون الاسم العربي نصًا.',
            'min' => 'يجب ألا يقل الاسم العربي عن :min حروف.',
            'max' => 'يجب ألا يتجاوز الاسم العربي :max حروف.',
            'unique' => 'هذا الاسم العربي موجود بالفعل في هذا القسم.',
        ],
        'chields' => [
            'required' => 'حقل الأبناء مطلوب.',
            'array' => 'يجب أن تكون الأبناء مصفوفة.',
        ],
        'uuid' => [
            'required' => 'حقل المعرف الفريد مطلوب.',
            'exists' => 'المعرف الفريد المحدد غير صالح أو تم حذفه.',
            'unique' => 'هذا المعرف الفريد موجود بالفعل.',
            'uuid' => 'المعرف الفريد غير صالح.',
        ],
        'roleName' => [
            'required' => 'حقل اسم الدور الوظيفي مطلوب.',
            'exists' => 'هذا الدور الوظيفي غير موجود.',
            'unique' => 'اسم الدور مستخدم بالفعل.',
            'regex' => 'يجب أن يكون اسم الدور بدون مسافات.',
        ],
        'first_name' => [
            'required' => 'حقل الاسم الأول مطلوب.',
            'min' => 'يجب أن يحتوي الاسم الأول على الأقل على 3 أحرف.',
            'max' => 'يجب ألا يتجاوز الاسم الأول 255 حرفًا.',
            'string' => 'يجب أن يكون الاسم الأول نصًا.',
            'regex' => 'يجب أن يكون الاسم الأول نصًا.',
        ],
        'last_name' => [
            'required' => 'حقل الاسم الأخير مطلوب.',
            'min' => 'يجب أن يحتوي الاسم الأخير على الأقل على 3 أحرف.',
            'max' => 'يجب ألا يتجاوز الاسم الأخير 255 حرفًا.',
            'string' => 'يجب أن يكون الاسم الأخير نصًا.',
            'regex' => 'يجب أن يكون الاسم الأخير نصًا.',
        ],
        'email' => [
            'required' => 'حقل البريد الإلكتروني مطلوب.',
            'email' => 'البريد الإلكتروني غير صالح.',
            'unique' => 'البريد الإلكتروني مستخدم بالفعل.',
            'max' => 'يجب ألا يتجاوز البريد الإلكتروني 255 حرفًا.',
        ],
        'password' => [
            'required' => 'حقل كلمة المرور مطلوب.',
            'min' => 'يجب أن تحتوي كلمة المرور على الأقل على 8 أحرف.',
            'string' => 'يجب أن تكون كلمة المرور نصًا.',
            'regex' => 'يجب أن تحتوي على حرف صغير على الأقل، وحرف كبير، ورقم واحد.',
            'confirmed' => 'كلمة المرور غير متطابقة.',
        ],
        'user' => [
            'required' => 'حقل البريد الإلكتروني مطلوب.',
        ],
        'phone' => [
            'required' => 'حقل الهاتف مطلوب.',
            'unique' => 'الهاتف مستخدم بالفعل.', 'numeric' => 'يجب أن يكون الهاتف رقمًا.',
        ],
        'gender' => [
            'required' => 'حقل الجنس مطلوب.',
            'in' => 'يجب أن يكون الجنس ذكرًا أو أنثى.',
        ],
        'alt' => [
            'string' => 'يجب أن يكون النص البديل نصًا.',
        ],
        'job' => [
            'string' => 'يجب أن يكون الوظيفة نصًا.',
        ],
        'job_id' => [
            'numeric' => 'يجب أن يكون الوظيفة رقمًا.',
        ],
        'old_password' => [
            'required' => 'حقل كلمة المرور القديمة مطلوب.',
            'min' => 'يجب أن تحتوي كلمة المرور القديمة على الأقل على 8 أحرف.',
            'string' => 'يجب أن تكون كلمة المرور القديمة نصًا.',
        ],
        'active' => [
            'required' => 'حقل النشط مطلوب.',
            'in' => 'يجب أن يكون النشط قيمة منطقية (boolean).',
        ],
        'image' => [
            'required' => 'حقل الصورة مطلوب.',
            'image' => 'يجب أن تكون الصورة صورة.',
            'mimes' => 'يجب أن تكون الصورة من نوع: jpeg, jpg, png.',
            'max' => 'يجب ألا تتجاوز الصورة 2MB.',
        ],
        'type' => [
            'required' => 'حقل النوع مطلوب.',
        ],
        'displayName' => [
            'required' => 'حقل اسم العرض مطلوب.',
            'unique' => 'اسم العرض مستخدم بالفعل.',
        ],
        'description' => [
            'required' => 'حقل الوصف مطلوب.',
            'string' => 'يجب أن يكون الوصف نصًا.',
            'array' => 'يجب ادخال الوصف بالعربية و الانكليزية'
        ],'description.en' => [
            'required' => 'حقل الوصف بالانكليزية مطلوب.',
            'string' => 'يجب أن يكون الوصف نصًا.',
        ],'description.ar' => [
            'required' => 'حقل الوصف بالعربية مطلوب.',
            'string' => 'يجب أن يكون الوصف نصًا.',
        ],
        'permission' => [
            'required' => 'حقل الصلاحية مطلوب.',
        ],
        'role' => [
            'required' => 'حقل الدور مطلوب.',
            'exists' => 'هذا الدور غير موجود.',
        ],
        'title' => [
            'required' => 'العنوان مطلوب.',
            'string' => 'يجب ان يكون العنوان نصًا.'
        ],
        'body' => [
            'required' => 'لاشعار مطلوب.',
            'string' => 'الاشعار يجب ان يكون نص.'
        ],
        'group_uuid' => [
            'exists' => 'المجموعة غير صالحة',
        ]
    ],
    'attributes' => [
        'department_uuid' => 'معرف القسم',
        'name' => 'الاسم',
        'name.en' => 'الاسم الإنجليزي',
        'name.ar' => 'الاسم العربي',
        'chields' => 'الأبناء',
        'uuid' => 'المعرف الفريد',
        'roleName' => 'الدور الوظيفي',
        'first_name' => 'الاسم الأول',
        'last_name' => 'الاسم الأخير',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'user' => 'البريد الإلكتروني',
        'phone' => 'الهاتف',
        'gender' => 'الجنس',
        'alt' => 'النص البديل',
        'job' => 'الوظيفة',
        'job_id' => 'الوظيفة',
        'old_password' => 'كلمة المرور القديمة',
        'active' => 'النشط',
        'image' => 'الصورة',
        'type' => 'النوع',
        'displayName' => 'اسم العرض',
        'description' => 'الوصف',
        'permission' => 'الصلاحية',
        'role' => 'الدور',],
];
