<?php

return [
    'custom' => [
        'department_uuid' => [
            'required' => 'حقل معرف القسم مطلوب.',
            'exists' => 'معرف القسم المحدد غير صالح.',
            "unique" => "هذا القسم موجود بالفعل.",
            "uuid" => "المعرف الفريد غير صالح.",
        ],
        'name' => [
            'required' => 'حقل الاسم مطلوب.',
            "array" => 'يجب ارسال الاسم بشكل مصفوفة '
        ],
        'name.en' => [
            'required' => 'حقل الاسم الإنجليزي مطلوب.',
            'string' => 'يجب أن يكون الاسم الإنجليزي نصًا.',
            'min' => 'يجب ألا يقل الاسم الإنجليزي عن :min حروف.',
            'max' => 'يجب ألا يتجاوز الاسم الإنجليزي :max حروف.',
            'unique' => 'هذا الاسم الإنجليزي موجود بالفعل في هذا القسم.',
        ],
        'name.ar' => [
            'required' => 'حقل الاسم العربي مطلوب.',
            'string' => 'يجب أن يكون الاسم العربي نصًا.',
            'min' => 'يجب ألا يقل الاسم العربي عن :min حروف.',
            'max' => 'يجب ألا يتجاوز الاسم العربي :max حروف.',
            'unique' => 'هذا الاسم العربي موجود بالفعل في هذا القسم.',
        ],
        'chields' => [
            'required' => 'حقل الأبناء مطلوب.',
            'array' => 'يجب أن تكون الأبناء مصفوفة.',
        ],
        'uuid' => [
            'required' => 'حقل المعرف الفريد مطلوب.',
            'exists' => 'المعرف الفريد المحدد غير صالح أو تم حذفه.',
            'unique' => 'هذا المعرف الفريد موجود بالفعل.',
            'uuid' => 'المعرف الفريد غير صالح.',
        ]
    ],

    'attributes' => [
        'department_uuid' => 'معرف القسم',
        "name" => "الاسم",
        'name.en' => 'الاسم الإنجليزي',
        'name.ar' => 'الاسم العربي',
        'chields' => 'الأبناء',
        'uuid' => 'المعرف الفريد'
    ],
];
